Ran Plan for dir: `environment/test` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/atlantis-data/bin/terraform1.12.2 plan -input=false -refresh -out "/atlantis-data/repos/shwetaec12/eks-atlantis-demo/6/default/environment/test/default.tfplan"' in '/atlantis-data/repos/shwetaec12/eks-atlantis-demo/6/default/environment/test': exit status 1
module.eks.data.aws_partition.current: Reading...
data.aws_iam_policy_document.eks_node_group_assume: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/my-eks-cluster/cluster]
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0f71346aacb10106d]
aws_iam_openid_connect_provider.oidc: Refreshing state... [id=arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/3BFFE8CF83A9EF9B9503868907B06C39]
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_iam_policy_document.eks_node_group_assume: Read complete after 0s [id=2851119427]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=895976263444]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
aws_iam_role.node_group_role: Refreshing state... [id=eks-node-group-role]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=895976263444]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.data.aws_iam_session_context.current: Reading...
module.eks.aws_iam_role.this[0]: Refreshing state... [id=my-eks-cluster-cluster-20250608205255912900000001]
module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749935624559005501]
aws_iam_role.eks_admin: Refreshing state... [id=eks-admin]
aws_iam_role_policy_attachment.eks_admin_attach: Refreshing state... [id=eks-admin-20250608205256961200000006]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.aws_iam_policy_document.eks_admin_assume will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "eks_admin_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/3BFFE8CF83A9EF9B9503868907B06C39",
                ]
              + type        = "Federated"
            }
        }
    }

  # aws_iam_openid_connect_provider.oidc will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "oidc" {
        id              = "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/3BFFE8CF83A9EF9B9503868907B06C39"
      ~ tags            = {
          - "Environment" = "production" -> null
          - "Name"        = "my-eks-cluster-eks-irsa" -> null
        }
      ~ tags_all        = {
          - "Environment" = "production" -> null
          - "Name"        = "my-eks-cluster-eks-irsa" -> null
        }
      ~ thumbprint_list = [
          ~ "06b25927c42a721631c1efd9431e648fa62e1e39" -> "9e99a48a9960b14926bb7f3b02e22da0cbed5e11",
        ]
        # (3 unchanged attributes hidden)
    }

  # aws_iam_role.eks_admin will be updated in-place
  ~ resource "aws_iam_role" "eks_admin" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/3BFFE8CF83A9EF9B9503868907B06C39"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "eks-admin"
        name                  = "eks-admin"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
╷
│ Error: reading inline policies for IAM role eks-node-group-role, error: operation error IAM: GetRolePolicy, https response error StatusCode: 403, RequestID: b5706000-308c-44f7-afae-5784fbf42b26, api error AccessDenied: User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749935624559005501 is not authorized to perform: iam:GetRolePolicy on resource: role eks-node-group-role because no identity-based policy allows the iam:GetRolePolicy action
│ 
│   with aws_iam_role.node_group_role,
│   on main.tf line 70, in resource "aws_iam_role" "node_group_role":
│   70: resource "aws_iam_role" "node_group_role" {
│ 
╵
╷
│ Error: reading inline policies for IAM role my-eks-cluster-cluster-20250608205255912900000001, error: operation error IAM: GetRolePolicy, https response error StatusCode: 403, RequestID: f67436a7-492e-4440-b0dd-71ed59a1dcd3, api error AccessDenied: User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749935624559005501 is not authorized to perform: iam:GetRolePolicy on resource: role my-eks-cluster-cluster-20250608205255912900000001 because no identity-based policy allows the iam:GetRolePolicy action
│ 
│   with module.eks.aws_iam_role.this[0],
│   on .terraform/modules/eks/main.tf line 293, in resource "aws_iam_role" "this":
│  293: resource "aws_iam_role" "this" {
│ 
╵
╷
│ Error: reading EC2 VPC (vpc-0f71346aacb10106d): operation error EC2: DescribeVpcs, https response error StatusCode: 403, RequestID: ae6c4724-fdfc-43c1-958b-a5f8d355db15, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749935624559005501 is not authorized to perform: ec2:DescribeVpcs because no identity-based policy allows the ec2:DescribeVpcs action
│ 
│   with module.vpc.aws_vpc.this[0],
│   on .terraform/modules/vpc/main.tf line 28, in resource "aws_vpc" "this":
│   28: resource "aws_vpc" "this" {
│ 
╵


```
</details>